Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32446E-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                                |FMPI2C1|I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |MFX_IRQ_OUT [STM32L152CCT6_IRQOUT]         |       |    |    |    |     |     |     |     |      |      |      |      |*IN0 |*TIM2_CH1 *TIM5_CH1                       |          |    |          |           
PA1 , // |SAI2_MCLKB [WM8994_MCLK1]                  |       |    |    |    |     |     |     |     |      |      |      |      |*IN1 |*TIM2_CH2 *TIM5_CH2                       |          |    |          |           
PA2 , // |SAI2_SCKB [WM8994_BCLK1]                   |       |    |    |    |     |     |     |     |      |*TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 *TIM5_CH3             |          |    |          |           
PA3 , // |ULPI_D0 [USB3300-EZK_DATA0]                |       |    |    |    |     |     |     |     |      |*RX   |      |      |*IN3 |*TIM2_CH4 *TIM5_CH4 +TIM9_CH2             |          |    |          |           
PA4 , // |ADC12_IN4 [P2]                             |       |    |    |    |     |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |ULPI_CK [USB3300-EZK_CLKOUT]               |       |    |    |    |*SCK |     |     |     |      |      |      |      |*IN5 |*TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |                                           |       |    |    |    |*MISO|     |     |     |      |      |      |      |*IN6 |*TIM3_CH1 +TIM13_CH1                      |          |    |          |           
PA7 , // |FMC_SDNWE [MT48LC4M16A2P-6A_WE\#]          |       |    |    |    |*MOSI|     |     |     |      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 *TIM3_CH2 *TIM1_CH1N|          |    |          |           
PA8 , // |RF_INT1                                    |       |    |    |*SCL|     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PA9 , // |USART1_TX [ST3241EBPR_T2IN]                |       |    |    |    |     |+SCK |     |     |*TX   |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PA10, // |USART1_RX [ST3241EBPR_R3OUT]               |       |    |    |    |     |     |     |     |*RX   |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PA11, // |USB_FS_DM                                  |       |    |    |    |     |     |     |     |      |      |      |      |     |+TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |USB_FS_DP                                  |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |JTMS/SWDIO                                 |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |JTCK/SWCLK                                 |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |JTDI                                       |       |    |    |    |     |     |     |     |      |      |      |      |     |+TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |ULPI_D1 [USB3300-EZK_DATA1]                |       |    |    |    |     |     |+MOSI|     |      |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 *TIM1_CH2N           |          |*D1 |          |           
PB1 , // |ULPI_D2 [USB3300-EZK_DATA2]                |       |    |    |    |     |     |     |     |      |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N *TIM8_CH3N           |          |*D2 |          |           
PB2 , // |ULPI_D4 [USB3300-EZK_DATA4]                |       |    |    |    |     |     |+MOSI|     |      |      |      |      |     |+TIM2_CH4                                 |          |*CK |          |           
PB3 , // |I2S3_CK [STM32F446ZET6_PB6]                |       |    |+SDA|    |+SCK |     |+SCK |     |      |      |      |      |     |+TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |LED_RED (LED3)                             |       |    |    |+SDA|+MISO|     |+MISO|     |      |      |      |      |     |+TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |ULPI_D7 [USB3300-EZK_DATA7]                |       |    |    |    |+MOSI|     |+MOSI|     |      |      |      |      |     |+TIM3_CH2                                 |          |    |          |           
PB6 , // |MIC_TIM4_CH1 [STM32F446ZET6_PB3]           |       |*SCL|    |    |     |     |     |     |+TX   |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PB7 , // |MIC_TIM4_CH2                               |       |*SDA|    |    |     |     |     |     |+RX   |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PB8 , // |RF_TIM2_CH1                                |       |+SCL|    |    |     |     |     |     |      |      |      |      |     |+TIM2_CH1 +TIM10_CH1 +TIM4_CH3            |          |*D4 |          |           
PB9 , // |RF_TIM2_CH2                                |       |+SDA|    |    |     |     |     |     |      |      |      |      |     |+TIM11_CH1 +TIM2_CH2 +TIM4_CH4            |          |*D5 |          |           
PB10, // |ULPI_D3 [USB3300-EZK_DATA3]                |       |    |+SCL|    |     |*SCK |     |     |      |      |*TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |LED_GREEN (LD1)                            |       |    |+SDA|    |     |     |     |     |      |      |+RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |ULPI_D5 [USB3300-EZK_DATA5]                |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |ULPI_D6 [USB3300-EZK_DATA6]                |       |    |    |    |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PB14, // |RF_SPI2_MISO                               |       |    |    |    |     |+MISO|     |     |      |      |      |      |     |*TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|    |          |           
PB15, // |RF_SPI2_MOSI/2_SD                          |       |    |    |    |     |+MOSI|     |     |      |      |      |      |     |*TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|    |          |           
PC0 , // |ULPI_STP [USB3300-EZK_STP]                 |       |    |    |    |     |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |I2S3_SD                                    |       |    |    |    |     |*MOSI|*MOSI|     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |ULPI_DIR [USB3300-EZK_DIR]                 |       |    |    |    |     |*MISO|     |     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |ULPI_NXT [USB3300-EZK_NXT]                 |       |    |    |    |     |+MOSI|     |     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |FMC_SDNE0 [MT48LC4M16A2P-6A_CS\#]          |       |    |    |    |     |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |FMC_SDCKE0 [MT48LC4M16A2P-6A_CKE]          |       |    |    |    |     |     |     |     |      |      |*RX   |      |*IN15|                                          |          |    |          |           
PC6 , // |                                           |+SCL   |+SCL|    |    |     |     |     |     |      |      |      |*TX   |     |*TIM8_CH1 +TIM3_CH1                       |          |*D6 |          |           
PC7 , // |RF_USART6_RX                               |+SDA   |+SDA|    |    |     |+SCK |     |     |      |      |      |*RX   |     |*TIM8_CH2 +TIM3_CH2                       |          |*D7 |          |           
PC8 , // |SDCARD_D0                                  |       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM8_CH3 +TIM3_CH3                       |          |*D0 |          |+TRACED0   
PC9 , // |SDCARD_D1                                  |       |    |    |*SDA|     |     |     |     |      |      |      |      |     |*TIM8_CH4 +TIM3_CH4                       |          |+D1 |          |           
PC10, // |SDCARD_D2                                  |       |    |    |    |     |     |*SCK |     |      |      |+TX   |      |     |                                          |          |+D2 |          |           
PC11, // |SDCARD_D3                                  |       |    |    |    |     |     |*MISO|     |      |      |+RX   |      |     |                                          |          |*D3 |          |           
PC12, // |SDCARD_CK                                  |       |    |+SDA|    |     |     |+MOSI|     |      |      |      |      |     |                                          |          |+CK |          |           
PC13, // |TAMPER_WKUP_KEY [B2]                       |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |OSC32_IN                                   |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |OSC32_OUT                                  |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |FMC_D2 [MT48LC4M16A2P-6A_DQ2]              |       |    |    |    |     |     |+MOSI|+MISO|      |      |      |      |     |                                          |          |    |          |           
PD1 , // |FMC_D3 [MT48LC4M16A2P-6A_DQ3]              |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |SDCARD_CMD                                 |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |           
PD3 , // |QSPI_CLK [N25Q256A13EF840E_C]              |       |    |    |    |     |+SCK |     |     |      |      |      |      |     |                                          |          |    |          |+TRACED1   
PD4 , // |FMC_NOE                                    |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |FMC_NWE                                    |       |    |    |    |     |     |     |     |      |+TX   |      |      |     |                                          |          |    |          |           
PD6 , // |RF_INT2                                    |       |    |    |    |     |     |+MOSI|     |      |+RX   |      |      |     |                                          |          |    |          |           
PD7 , // |FMC_NE1                                    |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |FMC_D13 [MT48LC4M16A2P-6A_DQ13]            |       |    |    |    |     |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |FMC_D14 [MT48LC4M16A2P-6A_DQ14]            |       |    |    |    |     |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |FMC_D15 [MT48LC4M16A2P-6A_DQ15]            |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |SAI2_SDA [WM8994_ADCDAT1]                  |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |I2C4_SCL [WM8994_SCLK]                     |+SCL   |+SCL|    |    |     |     |     |     |      |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PD13, // |I2C4_SDA [WM8994_SDA]                      |+SDA   |+SDA|    |    |     |     |     |     |      |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PD14, // |FMC_D0 [MT48LC4M16A2P-6A_DQ0]              |+SCL   |+SCL|    |    |     |     |     |     |      |      |      |      |     |*TIM4_CH3                                 |          |    |          |           
PD15, // |FMC_D1 [MT48LC4M16A2P-6A_DQ1]              |+SDA   |+SDA|    |    |     |     |     |     |      |      |      |      |     |*TIM4_CH4                                 |          |    |          |           
PE0 , // |FMC_NBL0 [MT48LC4M16A2P-6A_DQML]           |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |FMC_NBL1 [MT48LC4M16A2P-6A_DQMH]           |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |RF_SAI1_MCLK_A                             |       |    |    |    |     |     |     |*SCK |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |RF_SAI1_SD_B                               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |RF_SAI1_FS_A                               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |RF_SAI1_SCK_A                              |       |    |    |    |     |     |     |*MISO|      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |RF_SAI1_SD_A                               |       |    |    |    |     |     |     |*MOSI|      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |FMC_D4 [MT48LC4M16A2P-6A_DQ4]              |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |FMC_D5 [MT48LC4M16A2P-6A_DQ5]              |       |    |    |    |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |FMC_D6 [MT48LC4M16A2P-6A_DQ6]              |       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PE10, // |FMC_D7 [MT48LC4M16A2P-6A_DQ7]              |       |    |    |    |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |FMC_D8 [MT48LC4M16A2P-6A_DQ8]              |       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PE12, // |FMC_D9 [MT48LC4M16A2P-6A_DQ9]              |       |    |    |    |     |     |     |+SCK |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |FMC_D10 [MT48LC4M16A2P-6A_DQ10]            |       |    |    |    |     |     |     |+MISO|      |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PE14, // |FMC_D11 [MT48LC4M16A2P-6A_DQ11]            |       |    |    |    |     |     |     |+MOSI|      |      |      |      |     |*TIM1_CH4                                 |          |    |          |           
PE15, // |FMC_D12 [MT48LC4M16A2P-6A_DQ12]            |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |FMC_A0 [MT48LC4M16A2P-6A_A0]               |       |    |*SDA|    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |FMC_A1 [MT48LC4M16A2P-6A_A1]               |       |    |*SCL|    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |FMC_A2 [MT48LC4M16A2P-6A_A2]               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |FMC_A3 [MT48LC4M16A2P-6A_A3]               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF4 , // |FMC_A4 [MT48LC4M16A2P-6A_A4]               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF5 , // |FMC_A5 [MT48LC4M16A2P-6A_A5]               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF6 , // |QSPI_BK1_IO3 [N25Q256A13EF840E_HOLD\#/DQ3] |       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM10_CH1                                |          |    |          |           
PF7 , // |QSPI_BK1_IO2 [N25Q256A13EF840E_W\#/Vpp/DQ2]|       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM11_CH1                                |          |    |          |           
PF8 , // |QSPI_BK1_IO0 [N25Q256A13EF840E_DQ0]        |       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |QSPI_BK1_IO1 [N25Q256A13EF840E_DQ1]        |       |    |    |    |     |     |     |     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |RF_SPI2_CS                                 |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF11, // |FMC_SDNRAS [MT48LC4M16A2P-6A_RAS\#]        |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |FMC_A6 [MT48LC4M16A2P-6A_A6]               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |FMC_A7 [MT48LC4M16A2P-6A_A7]               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |FMC_A8 [MT48LC4M16A2P-6A_A8]               |*SCL   |*SCL|    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |FMC_A9 [MT48LC4M16A2P-6A_A9]               |*SDA   |*SDA|    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |FMC_A10 [MT48LC4M16A2P-6A_A10              |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |FMC_A11 [MT48LC4M16A2P-6A_A11]             |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |FMC_A12 [MT48LC4M16A2P-6A_A12]             |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |MFX_WAKEUP [STM32L152CCT6_WAKEUP]          |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |FMC_BA0 [MT48LC4M16A2P-6A_BA0]             |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |FMC_BA1 [MT48LC4M16A2P-6A_BA1]             |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |QSPI_BK1_NCS [N25Q256A13EF840E_S\#]        |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |RF_USART6_CK                               |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |FMC_SDCLK [MT48LC4M16A2P-6A_CLK]           |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |SAI2_FSB [WM8994_LRCLK1]                   |       |    |    |    |     |     |     |     |      |      |      |+RX   |     |                                          |          |    |          |           
PG10, // |SAI2_SDB [WM8994_DACDATA1]                 |       |    |    |    |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |SPDIF_RX0                                  |       |    |    |    |     |     |     |+SCK |      |      |      |      |     |                                          |          |    |          |           
PG12, // |RF_USART6_RTS                              |       |    |    |    |     |     |     |+MISO|      |      |      |      |     |                                          |          |    |          |           
